### PANDAS
- designed for working with heterogeneous or tabular data
- Series DataFrame

### SERIES

In [1]:
import pandas as pd

In [2]:
obj = pd.Series([1, 2, 3, 4])
obj

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
obj.array

<NumpyExtensionArray>
[1, 2, 3, 4]
Length: 4, dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
obj2['a']

1

In [8]:
obj2['d']

4

In [9]:
obj2[['c', 'a', 'd']]

c    3
a    1
d    4
dtype: int64

In [10]:
obj2[obj2 > 0]

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
obj2 * 2

a    2
b    4
c    6
d    8
dtype: int64

In [12]:
import numpy as np
np.exp(obj2)

a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [13]:
'b' in obj2

True

In [14]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
keys = sorted(list(sdata.keys())) + ['California']
obj4 = pd.Series(sdata, index=keys)
obj4

Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
California        NaN
dtype: float64

In [17]:
pd.isna(obj4)

Ohio          False
Oregon        False
Texas         False
Utah          False
California     True
dtype: bool

In [18]:
pd.notna(obj4)

Ohio           True
Oregon         True
Texas          True
Utah           True
California    False
dtype: bool

In [19]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
obj4

Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
California        NaN
dtype: float64

In [21]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah           10000.0
dtype: float64

In [22]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
California        NaN
Name: population, dtype: float64

In [23]:
obj

0    1
1    2
2    3
3    4
dtype: int64

In [24]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      1
Steve    2
Jeff     3
Ryan     4
dtype: int64

### DATAFRAME
- rectangular table of data, ordered and named collection of colunms<br>
- each column can have a different type
- can be thought of as a dictionary of a Series

In [25]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [27]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
pd.DataFrame(frame, columns=['state', 'year', 'pop'])

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
frame2 = pd.DataFrame(frame, columns=['state', 'year', 'pop', 'debt'])
frame2

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2001  2.4   NaN
4  Nevada  2002  2.9   NaN
5  Nevada  2003  3.2   NaN

In [30]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [31]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [32]:
frame2.loc[1]

state    Ohio
year     2001
pop       1.7
debt      NaN
Name: 1, dtype: object

In [33]:
frame2.iloc[2]

state    Ohio
year     2002
pop       3.6
debt      NaN
Name: 2, dtype: object

In [34]:
frame2['debt'] = 16.5
frame2

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2001  2.4  16.5
4  Nevada  2002  2.9  16.5
5  Nevada  2003  3.2  16.5

In [35]:
frame2['debt'] = np.arange(6)
frame2

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [36]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
frame2["debt"] = val
frame2

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2001  2.4   NaN
4  Nevada  2002  2.9   NaN
5  Nevada  2003  3.2   NaN

In [37]:
frame2['eastern'] = frame2['state'] == 'Ohio'
frame2

    state  year  pop  debt  eastern
0    Ohio  2000  1.5   NaN     True
1    Ohio  2001  1.7   NaN     True
2    Ohio  2002  3.6   NaN     True
3  Nevada  2001  2.4   NaN    False
4  Nevada  2002  2.9   NaN    False
5  Nevada  2003  3.2   NaN    False

In [38]:
del frame2['eastern']
frame2.columns

Index(['state', 'year', 'pop', 'debt'], dtype='object')

In [39]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [40]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [41]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [42]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [43]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [44]:
frame2.to_numpy()

array([['Ohio', 2000, 1.5, nan],
       ['Ohio', 2001, 1.7, nan],
       ['Ohio', 2002, 3.6, nan],
       ['Nevada', 2001, 2.4, nan],
       ['Nevada', 2002, 2.9, nan],
       ['Nevada', 2003, 3.2, nan]], dtype=object)

In [45]:
obj = pd.Series(np.arange(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [46]:
# indexes are immutable
# index[1] = 'd' would raise a TypeError
index[:1]

Index(['a'], dtype='object')

In [47]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [48]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [49]:
obj2.index is labels

True

In [50]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [51]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [52]:
# pandas Index can contain duplicate labels, unlike a python Set
pd.Index(['foo', 'foo', 'bar', 'bar'])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### ESSENTIAL FUNCTIONALITY

reindexing - create a new object with the values rearrange to allign with the new index

In [53]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [54]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [55]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [56]:
# forward fill
obj3.reindex(np.arange(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [57]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index = ['a', 'b', 'c'], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [58]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [59]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [60]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [61]:
frame.loc[['a', 'b', 'c'], ['California', "Texas"]]

   California  Texas
a           2      1
b           5      4
c           8      7

In [62]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [63]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [64]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: int32

In [65]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
data.drop(index=['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [67]:
data.drop(columns=['two'], axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [68]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [69]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [70]:
obj['b']

1.0

In [71]:
obj[1]

C:\Users\andre\AppData\Local\Temp\ipykernel_2056\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [72]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [73]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [74]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [75]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [76]:
obj.loc[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

it is prefered to us loc because we will not treater non-integer indexes as numbered indexes

In [77]:
# obj2.loc[[0, 1, 2]]
# //KeyError: "None of [Index([0, 1, 2], dtype='int32')] are in the [index]"

In [78]:
# iloc works consistently with integers
obj.iloc[[0, 1, 2]]

a    0.0
b    1.0
c    2.0
dtype: float64

In [79]:
obj2.loc['b':'e'] = 5
obj2

a   -5.3
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [80]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [82]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [83]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [84]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [86]:
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [87]:
data.loc[['Colorado', 'New York']]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [88]:
data.loc[['Colorado'], ['two', 'three']]

          two  three
Colorado    5      6

In [89]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [90]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [91]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [92]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [93]:
data.loc[:"Utah", 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [94]:
data.iloc[:, :3][data['three'] > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [95]:
data.loc[data['three'] >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

when using integer indexing in a Series object, we can't use negative indexing<br>
this is because we don't want to guess incase there in ambiguity<br>
however, we can use negative indexs with string keys<br>

we cannot chain selections, so instead rewrite a chainned assignment to use a single loc

In [96]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [97]:
data.loc[data.three == 10, 'three'] = 6
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9      6    11
New York   12   13     14    15

In [98]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])

In [99]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [100]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [101]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [102]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])

In [103]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [104]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [105]:
# returns the union of the two DataFrames
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [106]:
df1 = pd.DataFrame(np.arange(12).reshape(3, 4), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20).reshape(4, 5), columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [107]:
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [108]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [109]:
df1.add(df2, fill_value=0.0)
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [110]:
# doesn't work
df1.reindex(index=df2.columns, fill_value=0)
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [111]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [112]:
arr[0]

array([0, 1, 2, 3])

In [113]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [114]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]

In [115]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [116]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [117]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [118]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [119]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [120]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [121]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [122]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -0.949782 -0.769229 -0.190133
Ohio    0.675127 -0.039475 -0.820967
Texas   1.290965  0.548991  1.113599
Oregon  1.152837  1.383042  0.091473

In [123]:
np.abs(frame)

               b         d         e
Utah    0.949782  0.769229  0.190133
Ohio    0.675127  0.039475  0.820967
Texas   1.290965  0.548991  1.113599
Oregon  1.152837  1.383042  0.091473

In [124]:
def f1(x):
    return x.max() - x.min()
frame

               b         d         e
Utah   -0.949782 -0.769229 -0.190133
Ohio    0.675127 -0.039475 -0.820967
Texas   1.290965  0.548991  1.113599
Oregon  1.152837  1.383042  0.091473

In [125]:
frame.apply(f1)

b    2.240747
d    2.152271
e    1.934566
dtype: float64

In [126]:
# apply accross the columns
frame.apply(f1, axis='columns')

Utah      0.759649
Ohio      1.496094
Texas     0.741974
Oregon    1.291569
dtype: float64

In [127]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

            b         d         e
min -0.949782 -0.769229 -0.820967
max  1.290965  1.383042  1.113599

In [128]:
def my_format(x):
    return f"{x:.2f}"

frame.applymap(my_format)

C:\Users\andre\AppData\Local\Temp\ipykernel_2056\2705683181.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah    -0.95  -0.77  -0.19
Ohio     0.68  -0.04  -0.82
Texas    1.29   0.55   1.11
Oregon   1.15   1.38   0.09

In [129]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [130]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [131]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [132]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [133]:
frame.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [134]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [135]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [136]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values(na_position='first')

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [137]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [138]:
frame.sort_values('b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [139]:
frame.sort_values(['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [140]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [141]:
# assign rank according to the order in which they were observed in the data
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [142]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [143]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [144]:

obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [145]:
obj.index.is_unique

False

In [146]:
obj['a']

a    0
a    1
dtype: int32

In [147]:
obj['c']

4

In [148]:
df = pd.DataFrame(np.random.standard_normal((5, 3)), index=['a', 'a', 'b', 'b', 'c'])
df

          0         1         2
a -1.766392 -0.395767  1.151889
a -1.002201 -0.718761  1.661765
b -1.541160 -0.303826 -0.079531
b -1.147792 -1.283066 -2.607335
c -0.693866  0.391694 -1.438309

In [149]:
df.loc['b']

          0         1         2
b -1.541160 -0.303826 -0.079531
b -1.147792 -1.283066 -2.607335

In [150]:
df.loc['c']

0   -0.693866
1    0.391694
2   -1.438309
Name: c, dtype: float64

In [151]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [152]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [153]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [154]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [155]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [156]:
df.idxmax()

one    b
two    d
dtype: object

In [157]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [158]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [159]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [160]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [161]:
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [162]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [163]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [164]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [165]:
returns['MSFT'].corr(returns["IBM"])

0.4997636114415114

In [166]:
returns['MSFT'].cov(returns["IBM"])

8.870655479703546e-05

In [167]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [168]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [169]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [170]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [171]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [172]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [173]:
pd.value_counts(obj.to_numpy(), sort=False)

C:\Users\andre\AppData\Local\Temp\ipykernel_2056\164454357.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [174]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [175]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [176]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [177]:

to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [178]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [179]:
data['Qu1'].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [180]:
result = data.apply(pd.value_counts).fillna(0)

C:\Users\andre\AppData\Local\Temp\ipykernel_2056\2451317050.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [181]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [182]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [183]:
# DataFrame value_counts treats each row as a tuple and computes across a row
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64